Documents/ПланПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ПланПродаж</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланыПродаж</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МодулиИПодсистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКлиентовСреднее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СебестоимостьПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПлана</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаБлюда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыБлюд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКлиентов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКлиентовСреднее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЦП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийЧек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СредняяТранзакция</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СебестоимостьПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВаловыйДоход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПланыПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ПланыПродаж</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКлиентовСреднее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЦП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднийЧек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяТранзакция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкидкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВаловыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаБлюда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыБлюд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/МодулиИПодсистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>МодулиИПодсистемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ресторан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПланПродаж/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Документы.ПланПродаж.ПроверитьУникальностьДокумента(ЭтотОбъект) Тогда
		Сообщить("Документ " + СокрЛП(ЭтотОбъект.Метаданные().Синоним) + " по ресторану " +""""+ ЭтотОбъект.Ресторан +""""+ " на " + Формат(ЭтотОбъект.ДатаПланирования, "ДФ=dd.MM.yyyy") + " уже существует.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	ПодготовитьШапку(РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ПроцедурыОбменаДаннымиFrontOffice_Restoran.ЭтоЦентральнаяБаза(ПланыОбмена.ОбменДанными2K_CRS.ЭтотУзел()) Тогда
		Если ЭтотОбъект.Проведен Тогда
			ДвиженияПоРегиструПланыПродаж(Отказ);
		Иначе
			Движения.ПланыПродаж.Записывать = Истина;
			Движения.ПланыПродаж.Очистить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьШапку(РежимЗаписи, РежимПроведения)
	
	// Текущая дата
	ТекущаяДата = ТекущаяДата();
	
	// Распечатан
	Распечатан = (Проведен ИЛИ (РежимЗаписи = РежимЗаписиДокумента.Проведение)) И (НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения);
	
	// Состояние
	Состояние = УправлениеЗаказами.ПолучитьСостояниеДокумента(ЭтотОбъект, РежимЗаписи);
	
	// Модуль
	Модуль = ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Модуль, Перечисления.МодулиИПодсистемы.Ресторан);
	
	// Ресторан
	Ресторан = ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Ресторан, Справочники.Рестораны.ОсновнойРесторан());
	
	// ДатаНачалаПериода
	ДатаНачалаПериода = ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(ДатаНачалаПериода, Мин(ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(ДатаОкончанияПериода, ТекущаяДата), ТекущаяДата));
	
	// ДатаОкончанияПериода
	Если Распечатан ИЛИ ПометкаУдаления Тогда
		ДатаОкончанияПериода = ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(ДатаОкончанияПериода,	Макс(ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(ДатаНачалаПериода, ТекущаяДата), ТекущаяДата));
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьШапку()

Процедура ЗаполнитьСоставПлана() Экспорт
	
	
	ОчиститьРеквизитыТабличнойЧасти();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ГруппыБлюд.Ссылка
	               |ИЗ
	               |	Справочник.ГруппыБлюд КАК ГруппыБлюд
	               |ГДЕ
	               |	ГруппыБлюд.Актуальность
	               |	И НЕ ГруппыБлюд.ЭтоГруппа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СоставПлана.Добавить();
		НоваяСтрока.ГруппаБлюда = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКолонкиТабличнойЧасти(Колонка) Экспорт
	Если НЕ СоставПлана.Количество() Тогда
		Возврат;
	КонецЕсли;
	Если Колонка = "" Тогда
		Для Каждого СтрокаТабличнойЧасти Из СоставПлана Цикл
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ЭтотОбъект);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТабличнойЧасти Из СоставПлана Цикл
			СтрокаТабличнойЧасти[Колонка] = ЭтотОбъект[Колонка];
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура РассчитатьПоказателиТабличнойЧасти(НомерСтроки = "") Экспорт
	Если НЕ СоставПлана.Количество() Тогда
		Возврат;
	КонецЕсли;
	Если НомерСтроки = "" Тогда
		Для Каждого СтрокаТабличнойЧасти Из СоставПлана Цикл
			РассчитатьПоказателиСтрокиТабличнойЧасти(СтрокаТабличнойЧасти);
		КонецЦикла;
	Иначе
		РассчитатьПоказателиСтрокиТабличнойЧасти(СоставПлана.Получить(НомерСтроки - 1));
	КонецЕсли;
КонецПроцедуры

Процедура РассчитатьПоказателиСтрокиТабличнойЧасти(СтрокаТабличнойЧасти) Экспорт
	СтрокаТабличнойЧасти.Количество 		= СтрокаТабличнойЧасти.КЦП * СтрокаТабличнойЧасти.КоличествоКлиентов;
	СтрокаТабличнойЧасти.СреднийЧек 		= СтрокаТабличнойЧасти.КЦП * СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.СредняяТранзакция 	= СтрокаТабличнойЧасти.СреднийЧек * СтрокаТабличнойЧасти.КоличествоКлиентовСреднее;
	СтрокаТабличнойЧасти.Сумма 				= СтрокаТабличнойЧасти.СреднийЧек * СтрокаТабличнойЧасти.КоличествоКлиентов;
	СтрокаТабличнойЧасти.СуммаБезСкидок 	= СтрокаТабличнойЧасти.Сумма / ((100 - СтрокаТабличнойЧасти.СкидкаПроцент) / 100);
	СтрокаТабличнойЧасти.СуммаСкидки 		= СтрокаТабличнойЧасти.СуммаБезСкидок - СтрокаТабличнойЧасти.Сумма;
	СтрокаТабличнойЧасти.Себестоимость 		= СтрокаТабличнойЧасти.Сумма * (СтрокаТабличнойЧасти.СебестоимостьПроцент / 100);
	СтрокаТабличнойЧасти.ВаловыйДоход 		= СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.Себестоимость;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияПоРегистрам(РежимПроведенияДокумента.Неоперативный, Отказ);
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(РежимПроведения, Отказ)
	
	ДвиженияПоРегиструПланыПродаж(Отказ);
	
КонецПроцедуры

Процедура ДвиженияПоРегиструПланыПродаж(Отказ)
	
	Движения.ПланыПродаж.Записывать = Истина;
	Движения.ПланыПродаж.Очистить();
	Для Каждого ТекСтрокаСоставПлана Из СоставПлана Цикл
		Движение 							= Движения.ПланыПродаж.Добавить();
		Движение.Период 					= ДатаПланирования;
		Движение.Ресторан 					= Ресторан;
		Движение.ГруппаБлюда 				= ТекСтрокаСоставПлана.ГруппаБлюда;
		Движение.ДокументПланирования 		= Ссылка;
		Движение.КоличествоКлиентов 		= ТекСтрокаСоставПлана.КоличествоКлиентов;
		Движение.КоличествоКлиентовСреднее 	= ТекСтрокаСоставПлана.КоличествоКлиентовСреднее;
		Движение.Количество 				= ТекСтрокаСоставПлана.Количество;
		Движение.КЦП 						= ТекСтрокаСоставПлана.КЦП;
		Движение.Цена 						= ТекСтрокаСоставПлана.Цена;
		Движение.СреднийЧек 				= ТекСтрокаСоставПлана.СреднийЧек;
		Движение.СредняяТранзакция 			= ТекСтрокаСоставПлана.СредняяТранзакция;
		Движение.СуммаБезСкидок 			= ТекСтрокаСоставПлана.СуммаБезСкидок;
		Движение.СуммаСкидки 				= ТекСтрокаСоставПлана.СуммаСкидки;
		Движение.СкидкаПроцент 				= ТекСтрокаСоставПлана.СкидкаПроцент;
		Движение.Сумма 						= ТекСтрокаСоставПлана.Сумма;
		Движение.Себестоимость 				= ТекСтрокаСоставПлана.Себестоимость;
		Движение.СебестоимостьПроцент 		= ТекСтрокаСоставПлана.СебестоимостьПроцент;
		Движение.ВаловыйДоход 				= ТекСтрокаСоставПлана.ВаловыйДоход;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОчиститьРеквизиты();
	
КонецПроцедуры

Процедура ОчиститьРеквизиты()
	
	// Шапка.
	ОчиститьРеквизитыШапки();
	
	// Табличная часть.
	ОчиститьРеквизитыТабличнойЧасти();
	
КонецПроцедуры

Процедура ОчиститьРеквизитыШапки()
	
	ДатаНачалаПериода 		= Неопределено;
	ДатаОкончанияПериода 	= Неопределено;
	ДатаПланирования 		= Неопределено;
	Распечатан 				= Неопределено;
	
КонецПроцедуры

Процедура ОчиститьРеквизитыТабличнойЧасти()
	
	СоставПлана.Очистить();
	
КонецПроцедуры
